{"keras_version": "2.2.4-tf", "config": {"name": "sequential_36", "layers": [{"config": {"activation": "relu", "dilation_rate": [1, 1], "name": "conv2d_43", "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null, "batch_input_shape": [null, 720, 480, 3], "dtype": "float32", "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [4, 4], "filters": 16, "padding": "same", "kernel_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_43", "data_format": "channels_last", "strides": [8, 8], "dtype": "float32", "padding": "valid", "pool_size": [8, 8], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_35", "data_format": "channels_last", "dtype": "float32", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "kernel_constraint": null, "name": "dense_70", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "units": 100, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "softmax", "kernel_constraint": null, "name": "dense_71", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "units": 2, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow"}