{"keras_version": "2.2.4-tf", "config": {"name": "sequential", "layers": [{"config": {"strides": [1, 1], "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "trainable": true, "name": "conv2d", "activation": "relu", "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [4, 4], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "batch_input_shape": [null, 720, 480, 3], "filters": 16}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "strides": [8, 8], "pool_size": [8, 8], "trainable": true, "name": "max_pooling2d", "dtype": "float32", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten", "dtype": "float32", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "trainable": true, "name": "dense", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "use_bias": true, "dtype": "float32", "units": 100, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "trainable": true, "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "use_bias": true, "dtype": "float32", "units": 2, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "softmax"}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow"}